Ferapont/src/InformationRegisters/АктивныеСеансы/АктивныеСеансы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АктивныеСеансы</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Cookie</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Ferapont/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <predefined>
    <items>
      <name>Ферапонт</name>
      <description>Ферапонт</description>
    </items>
    <items>
      <name>ЭтотПользователь</name>
      <description>Этот пользователь</description>
    </items>
  </predefined>
  <attributes>
    <name>Telegram</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VK</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Никнейм</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешилПисатьVK</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныеНастройки</name>
    <type>
      <types>CatalogRef.ПерсональныеНастройки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТГ_БотОстановлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Ferapont/src/HTTPServices/Bot/Module.bsl
#Область ОбработчикиСобытий

Функция tgbotlogIn(Запрос)    
    
    Возврат МетодыApiСайта.tgbotlogIn(Запрос);
    
КонецФункции

Функция vklogintakeData(Запрос)
        
    Возврат МетодыApiСайта.vklogintakeData(Запрос);
    
КонецФункции

Функция vkbottakeData(Запрос)
    
    Возврат МетодыApiСайта.vkbottakeData(Запрос);
    
КонецФункции

Функция takeStartsendData(Запрос)
    
    Возврат МетодыApiСайта.takeStartsendData(Запрос);
    
КонецФункции

Функция vkbotcallBack(Запрос)    
    Ответ = Новый HTTPСервисОтвет(200);
    Возврат Ответ;    
КонецФункции

Функция tgbotgetLog(Запрос)
    Ответ = Новый HTTPСервисОтвет(200);
    Возврат Ответ;
КонецФункции

Функция takeStartcallBack(Запрос)
    Ответ = Новый HTTPСервисОтвет(200);
    Возврат Ответ;
КонецФункции

Функция tgbotcallBack(Запрос)
    Ответ = Новый HTTPСервисОтвет(200);
    Возврат Ответ;
КонецФункции

Функция vklogincallBack(Запрос)
    Ответ = Новый HTTPСервисОтвет(200);
    Возврат Ответ;
КонецФункции

Функция vkbotcors(Запрос)
    Ответ = Новый HTTPСервисОтвет(200);
    Возврат Ответ;
КонецФункции

Функция miniAppwriteNewSession(Запрос)
	
	Попытка
		
		Ответ = Новый HTTPСервисОтвет(200);
		
		Печенька     	= Запрос.ПараметрыЗапроса.Получить("cookie");
		ID           	= Запрос.ПараметрыЗапроса.Получить("id");
		Никнейм			= Запрос.ПараметрыЗапроса.Получить("nick");

		ПользовательИБ 	= Справочники.Пользователи.НайтиПоРеквизиту("Telegram", ID);
		
		Имя				= Запрос.ПараметрыЗапроса.Получить("first");
		Имя				= ?(ЗначениеЗаполнено(Имя), Имя, "");
		
		Фамилия			= Запрос.ПараметрыЗапроса.Получить("last");
		Фамилия			= ?(ЗначениеЗаполнено(Фамилия), Фамилия, " ");
				
		Если Не ЗначениеЗаполнено(ПользовательИБ) И ЗначениеЗаполнено(ID) Тогда
			
			ИмяПользователя = Имя + " " + Фамилия;
			
			НовыйПользователь                         = Справочники.Пользователи.СоздатьЭлемент();
			НовыйПользователь.ПерсональныеНастройки   = Справочники.ПерсональныеНастройки.Инициализировать(ИмяПользователя);
			НовыйПользователь.Telegram                = ID;
			НовыйПользователь.Наименование            = ИмяПользователя;
			НовыйПользователь.ДатаРегистрации         = ТекущаяДатаСеанса();
			НовыйПользователь.Никнейм                 = ?(ЗначениеЗаполнено(Никнейм), Никнейм, "");
			НовыйПользователь.Записать();

			ПользовательИБ = НовыйПользователь.Ссылка;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПользовательИБ) Тогда
			
			МЗ = РегистрыСведений.АктивныеСеансы.СоздатьМенеджерЗаписи();
			МЗ.Cookie       = Печенька;
			МЗ.Пользователь = ПользовательИБ;
			МЗ.Дата         = ТекущаяДатаСеанса();
			МЗ.Записать(Истина);
					
		КонецЕсли;
		
		Возврат Ответ;
		
	Исключение
		
		ИнструментарийВызовСервера.ЗаписьВЖурналИсключений(ОписаниеОшибки());
		
	КонецПопытки;
	
КонецФункции

Функция miniAppCORSCallback(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

#КонецОбласти
